<!-- placeholder-1 -->
```fish
terraform plan -chdir=. -refresh=true
```
<!-- placeholder-2 -->

<details open><summary>Diff of 1 change.</summary>

```diff
! module.vm_minimal_config.proxmox_virtual_environment_vm.vm will be updated in-place
```
</details>
<!-- placeholder-3 -->
<details><summary>Plan: 0 to add, 1 to change, 0 to destroy.</br>

<!-- placeholder-4 -->
###### By @b- at 2025-08-15T04:05:32Z [(view log)](https://github.com/perchnet/p/actions/runs/16982661815/job/48145716860#step:11:1).
</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # module.vm_minimal_config.proxmox_virtual_environment_vm.vm will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "vm" {
        id                      = "131"
      ~ ipv4_addresses          = [] -> (known after apply)
      ~ ipv6_addresses          = [] -> (known after apply)
        name                    = "vm-ubuntu22-minimal"
      ~ network_interface_names = [] -> (known after apply)
      ~ started                 = false -> true
        tags                    = [
            "terraform",
        ]
        # (25 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```
</details>
<!-- placeholder-5 -->
<!-- terraform-55-3eee8c84341b95e00d4d4dd1307a8268.tfplan -->
<!-- placeholder-6 -->